justinh-rahb/DragonStatus/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# Required for Bambu LAN MQTT's printer-local certificate.  The client is
# read-only and only relaxes verification for this explicitly configured LAN peer.
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y
